---
title: RebarContainerType
classe: Autodesk.Revit.DB.Structure.RebarContainerType
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# RebarContainerType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CreateDefaultRebarContainerType(Document)` | `RebarContainerType.CreateDefaultRebarContainerType(aDoc)` | ElementId |
| `ElementId GetOrCreateRebarContainerType(Document, String)` | `RebarContainerType.GetOrCreateRebarContainerType(aDoc, name)` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```